org/2018.org
#+HUGO_BASE_DIR: ../
#+HUGO_SECTION: ./posts
#+OPTIONS: author:nil

*** TODO en
:PROPERTIES:
:EXPORT_TITLE: Get =emacs= To Work With =fcitx=
:EXPORT_FILE_NAME: get-emacs-to-work-with-fcitx.en.md
:END:

**** Enabling fcitx in emacs

***** fcitx-diagnose

***** locale settings
export zh_cn.utf-8
set lc_ctype=zh_cn.utf-8

***** fcitx plugin in emacs

***** disabling ctrl+space hot key
replaced with os+space and ctrl+os


**** could be better

do not want set lc-ctype globally
run emacs as daemon

***** create new entry in .config/systemd/user/emacs.service

***** add environment variable

***** problem: does not load init file


***** setting up alias of emacsclient -nc in .zshrc
alias e="emacsclient -nc"

